In [7]:
import pandas as pd

In [14]:
GDP = {"Maharashtra": 32.24,
        "Tamil Nadu": 19.43,
        "Uttar Pradesh": 17.05,
        "Karnataka":16.65,
        "Gujarat": 16.49}

Population = {"Maharashtra": 112374333,
        "Tamil Nadu": 72147030,
        "Uttar Pradesh": 199812341,
        "Karnataka":61095297,
        "Gujarat": 60439692}

Area = {"Maharashtra": 307713,
        "Tamil Nadu": 130058,
        "Uttar Pradesh": 240928,
        "Karnataka":191791,
        "Gujarat": 196024}

Dictrict = {"Maharashtra": 36,
        "Tamil Nadu": 37,
        "Uttar Pradesh": 75 ,
        "Karnataka": 30,
        "Gujarat": 33}

In [18]:
print(GDP,"\n",Population,"\n",Area,"\n", Dictrict )

{'Maharashtra': 32.24, 'Tamil Nadu': 19.43, 'Uttar Pradesh': 17.05, 'Karnataka': 16.65, 'Gujarat': 16.49}
 {'Maharashtra': 112374333, 'Tamil Nadu': 72147030, 'Uttar Pradesh': 199812341, 'Karnataka': 61095297, 'Gujarat': 60439692}
 {'Maharashtra': 307713, 'Tamil Nadu': 130058, 'Uttar Pradesh': 240928, 'Karnataka': 191791, 'Gujarat': 196024}
 {'Maharashtra': 36, 'Tamil Nadu': 37, 'Uttar Pradesh': 75, 'Karnataka': 30, 'Gujarat': 33}

In [81]:
## Making a series from the List
S = pd.Series([1,2,3], index = ['A',"B",'C'])
S

A    1
B    2
C    3
dtype: int64

In [52]:
## Making a series form Dictionary

GDP_S = pd.Series(GDP)
Pop_S = pd.Series(Population)
Area_S = pd.Series(Area)
District_S = pd.Series(Dictrict)

In [25]:
## Printing the Series
GDP_S, Pop_S

(Maharashtra      32.24
 Tamil Nadu       19.43
 Uttar Pradesh    17.05
 Karnataka        16.65
 Gujarat          16.49
 dtype: float64,
 Maharashtra      112374333
 Tamil Nadu        72147030
 Uttar Pradesh    199812341
 Karnataka         61095297
 Gujarat           60439692
 dtype: int64)

In [64]:
## Creating the Series from Dictionay with specifying the Index

S2 = pd.Series([1,2,3,4,5],index = ["M", "TN", "UP", "K","K"])

In [65]:
## When you pass the index parameter in the series function with a dictionary, It gives preference to the Index, and tries
## to match the value corresponding to the index form the dictionay provided. Returns NaN, if the value is not found in the dictionay
## for matching index. 

S2

M     1
TN    2
UP    3
K     4
K     5
dtype: int64

In [108]:
#Scaler Data in the Series

Scaler_Series1 = pd.Series("Apoorvaa", index = range(5))
Scaler_Series2 = pd.Series(["Apoorvaa","Arpita", "Shubham", "Kishan", "Uma"], index = [1,2,3,4,5])
Scaler_Series2

1    Apoorvaa
2      Arpita
3     Shubham
4      Kishan
5         Uma
dtype: object

In [89]:
#Attributes of the Series 

S2.values, S2.index

(array([1, 2, 3, 4, 5], dtype=int64),
 Index(['M', 'TN', 'UP', 'K', 'K'], dtype='object'))

In [91]:
list(S2.items())

[('M', 1), ('TN', 2), ('UP', 3), ('K', 4), ('K', 5)]

In [96]:
## Accessing the Data from the Series
## Basically when you are passing in the the integers in the square bracket, it is Python's implicit indexing (if the indexis string)
GDP_S[1]

19.43

In [111]:
Scaler_Series2[0:2] #  implicit indexing used.

1    Apoorvaa
2      Arpita
dtype: object

In [104]:
GDP_S["Maharashtra"]

32.24

In [107]:
# Use Python's Dictionary's expressions

"Karnataka" in GDP_S.keys()

True

In [113]:
GDP_S.loc["Maharashtra"] # Method always use the Explicit method of indexing
GDP_S.iloc[0] # Method uses the implicit method of indexing

32.24

In [114]:
## Making the DataFrames from Series. 

df = pd.DataFrame(GDP_S, columns= ["GDP of State"])
df

               GDP of State
Maharashtra           32.24
Tamil Nadu            19.43
Uttar Pradesh         17.05
Karnataka             16.65
Gujarat               16.49

In [115]:
# Dataframe from a List of Dictionaries. The dictionary keys will serve as the column header. 
df = pd.DataFrame([GDP, Area])
df

   Maharashtra  Tamil Nadu  Uttar Pradesh  Karnataka    Gujarat
0        32.24       19.43          17.05      16.65      16.49
1    307713.00   130058.00      240928.00  191791.00  196024.00

In [116]:
## Creating the DataFrame from the list of the Series 
# Notice that the Index of the Series become the column header in this case

df = pd.DataFrame([GDP_S,Pop_S,Area_S,District_S ])
df

    Maharashtra   Tamil Nadu  Uttar Pradesh    Karnataka      Gujarat
0  3.224000e+01        19.43   1.705000e+01        16.65        16.49
1  1.123743e+08  72147030.00   1.998123e+08  61095297.00  60439692.00
2  3.077130e+05    130058.00   2.409280e+05    191791.00    196024.00
3  3.600000e+01        37.00   7.500000e+01        30.00        33.00

In [120]:
## DataFrame created from the Dictionary of Series. 

EconomicData = pd.DataFrame({"GDP": GDP_S, 
                   "Population" :Pop_S,
                   "Area" :Area_S,
                   "Dictrict": District_S})

EconomicData

                 GDP  Population    Area  Dictrict
Maharashtra    32.24   112374333  307713        36
Tamil Nadu     19.43    72147030  130058        37
Uttar Pradesh  17.05   199812341  240928        75
Karnataka      16.65    61095297  191791        30
Gujarat        16.49    60439692  196024        33

In [122]:
## Selecting the Single columns

EconomicData["GDP"] # Square bracketing method
EconomicData.GDP #Dot Notation/ Attribute style

Maharashtra      32.24
Tamil Nadu       19.43
Uttar Pradesh    17.05
Karnataka        16.65
Gujarat          16.49
Name: GDP, dtype: float64

In [124]:
# Accessing the Multiple columns
EconomicData[["Area","GDP" ]]

                 Area    GDP
Maharashtra    307713  32.24
Tamil Nadu     130058  19.43
Uttar Pradesh  240928  17.05
Karnataka      191791  16.65
Gujarat        196024  16.49

In [129]:
pd.set_option('display.float_format', lambda x: '%.2f' % x)

In [140]:
# Accessing the rows of the DataFrame

EconomicData.iloc[0:2]

              GDP  Population    Area  Dictrict
Maharashtra 32.24   112374333  307713        36
Tamil Nadu  19.43    72147030  130058        37

In [141]:
EconomicData

                GDP  Population    Area  Dictrict
Maharashtra   32.24   112374333  307713        36
Tamil Nadu    19.43    72147030  130058        37
Uttar Pradesh 17.05   199812341  240928        75
Karnataka     16.65    61095297  191791        30
Gujarat       16.49    60439692  196024        33

In [143]:
EconomicData["Per_District_GDP"] = EconomicData["GDP"]/EconomicData["Dictrict"]

In [144]:
EconomicData

                GDP  Population    Area  Dictrict  Per_District_GDP
Maharashtra   32.24   112374333  307713        36              0.90
Tamil Nadu    19.43    72147030  130058        37              0.53
Uttar Pradesh 17.05   199812341  240928        75              0.23
Karnataka     16.65    61095297  191791        30              0.55
Gujarat       16.49    60439692  196024        33              0.50

# Understanding how to combine the DataFrames Together

In [145]:
data = pd.DataFrame({"A": [1,2,3], 
                        "B": [4,5,6], 
                        "C": [7,8,9]}, index = ["a","b","c"])

In [146]:
data

   A  B  C
a  1  4  7
b  2  5  8
c  3  6  9

In [147]:
data2 = pd.DataFrame({"A": [11,12,13], 
                        "B": [14,15,16], 
                        "C": [17,18,19]}, index = ["a","b","c"])
data2

    A   B   C
a  11  14  17
b  12  15  18
c  13  16  19

In [148]:
data3 = pd.DataFrame({"A": [11,12,13], 
                        "B": [14,15,16], 
                        "C": [17,18,19]}, index = ["d","e","f"])
data3

    A   B   C
d  11  14  17
e  12  15  18
f  13  16  19

In [149]:
data4 = pd.DataFrame({"A": [21,22,23], 
                        "B": [24,25,26], 
                        "D": [27,28,29]}, index = ["a","b","c"])
data4

    A   B   D
a  21  24  27
b  22  25  28
c  23  26  29

In [160]:
# Basic concatenation with the same index and same Column names - as in most of the cases
pd.concat([data, data2],ignore_index= True)

    A   B   C
0   1   4   7
1   2   5   8
2   3   6   9
3  11  14  17
4  12  15  18
5  13  16  19

In [161]:
# Concatenation with same header and different index

pd.concat([data, data3]) # since here the columns are same, the concatenation happened nicely

    A   B   C
a   1   4   7
b   2   5   8
c   3   6   9
d  11  14  17
e  12  15  18
f  13  16  19

In [167]:
pd.concat([data, data3], axis = 0, 
          keys = ["A","B"])

      A   B   C
A a   1   4   7
  b   2   5   8
  c   3   6   9
B d  11  14  17
  e  12  15  18
  f  13  16  19

In [168]:
# Data Merging

Student = pd.DataFrame({"Name": ["Abhi","Meera", "Seema", "Reeta"], 
                        "Class": [2,3,5,6], 
                        "Subject": ["Math", "Science", "English", "Math"]})

In [169]:
Marks = pd.DataFrame({"Name": ["Abhi","Meera", "Seema", "Reeta", "Abhi","Meera", "Seema", "Reeta", "Abhi","Meera", "Seema", "Reeta"], 
                        "Subject": ["Math","Math","Math","Math" ,"Science","Science","Science","Science", "English","English","English","English"], 
                     "Marks": [20, 22, 21, 19, 24, 23, 19, 22, 19, 20, 21, 20]})

In [170]:
Student

    Name  Class  Subject
0   Abhi      2     Math
1  Meera      3  Science
2  Seema      5  English
3  Reeta      6     Math

In [171]:
Marks

     Name  Subject  Marks
0    Abhi     Math     20
1   Meera     Math     22
2   Seema     Math     21
3   Reeta     Math     19
4    Abhi  Science     24
5   Meera  Science     23
6   Seema  Science     19
7   Reeta  Science     22
8    Abhi  English     19
9   Meera  English     20
10  Seema  English     21
11  Reeta  English     20

In [176]:
pd.merge(Student,Marks)

    Name  Class  Subject  Marks
0   Abhi      2     Math     20
1  Meera      3  Science     23
2  Seema      5  English     21
3  Reeta      6     Math     19